[{"additionalPlain":"how is life at CRED? \n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating.  \n\nat CRED, we guarantee a good company. \n\nhard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.  \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.  \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n\n","additional":"<div><b style=\"font-size: 10.5pt\">how is life at CRED?&nbsp;</b></div><div><br></div><div><span style=\"font-size: 10.5pt\">working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating.&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">at CRED, we guarantee a good company.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">hard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</span></div><div><br></div>","categories":{"commitment":"full time","department":"business","location":"Bengaluru, Karnataka","team":"business- brand promotions"},"createdAt":1674481297156,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India's most trustworthy and creditworthy individuals, where the members are rewarded for good financial behaviour. \n\nCRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behaviour to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere's what will be in store for you at CRED once you join the team\n","description":"<div><b style=\"font-size: 10.5pt\">what is CRED?</b></div><div><br></div><div><span style=\"font-size: 10.5pt\">CRED is an exclusive community for India's most trustworthy and creditworthy individuals, where the members are rewarded for good financial behaviour.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behaviour to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">here's what will be in store for you at CRED once you join the team</span></div>","id":"4512f7d8-e190-47a3-be96-6613681c6c8c","lists":[{"text":"what you will do?","content":"<li>create a systematic, process-driven approach to identify and source agency partnership opportunities&nbsp;</li><li>retains and grows existing business (top and independent agencies), identify new players in the market and undertake their onboarding</li><li>develops a best in class partnership with agencies by being the primary liaison, advocate and navigator for the agency in all partner platforms</li><li>collaborates with agency influencers to drive product adoption across the agency and strategically on agency priority accounts</li><li>communicate clearly the progress of monthly/quarterly initiatives to internal and external stakeholders, including the ability to synthesize feedback and adjust plans accordingly</li><li>create and collaborate on education &amp; inspiration programs across the agency which has a scaled impact on various constituents (media, digital, strategic planning, and creative)</li><li>act on behalf of agency interests and lead solutions within internal cross-functional teams, resulting in growth of partnership across different CRED platforms</li><li>plan and own monthly/quarterly supply &amp; monetization goals with new and existing partner relationships&nbsp;</li><li>help the product team discover brand/merchant needs more effectively and help evolve the CRED product</li>"},{"text":"you should apply if you: ","content":"<li>have 7-10 years of expertise working in an agency or managing an agency partnership with premium publishers in partner-facing roles</li><li>have managed marketing budgets and targets for clients across multiple industries</li><li>are familiar with current digital avenues and metrics brands leverage for awareness, visibility &amp; engagement</li><li>have an established network of relationship across digital media agencies</li><li>are an excellent negotiator; have outstanding communication and interpersonal skills</li><li>are comfortable with data and research in order to be able to map the potential of each brand, category or industry</li><li>are goal-oriented &amp; thrive in high ownership, fast paced and independent environments</li><li>have the ability to deal with ambiguity and chart a path forward</li><li>have excellent organisational and time management skills</li><li>have ideally, been a people manager in the past</li>"}],"text":"agency partnerships lead","country":"IN","workplaceType":"onsite","hostedUrl":"https://jobs.lever.co/cred/4512f7d8-e190-47a3-be96-6613681c6c8c","applyUrl":"https://jobs.lever.co/cred/4512f7d8-e190-47a3-be96-6613681c6c8c/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div>","categories":{"commitment":"full time","department":"engineering","location":"Bengaluru, Karnataka","team":"Mobile - Android"},"createdAt":1641303378407,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a part of the team \n","description":"<div><b>what is CRED?</b></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.&nbsp;CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception.&nbsp;to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a part of the team&nbsp;</div>","id":"f1b5843c-7a21-4747-8f08-3fa442aa7b9a","lists":[{"text":"what will you do:","content":"<li>work on a disruptive product that’s still in its early stages</li><li>be responsible for the development and maintenance of the CRED app aimed at a vast number of diverse android devices.</li><li>translate designs and wireframes into high-quality code</li><li>ensure the best possible performance, quality, and responsiveness of the CRED app</li><li>mentor other engineers, defining our technical culture and helping to build a fast-growing team</li>"},{"text":"you should apply if you:","content":"<li>possess 2+ year of experience in product development, architecture, and design.</li><li>are experienced in kotlin, or have a strong desire to shift to kotlin</li><li>well versed with the latest Jet-pack Libraries</li><li>have experience with flutter and KMM</li><li>have strong knowledge of Android SDK, different versions of Android, and know how to deal with different screen sizes</li><li>have experience with storage, threading, and performance tuning.</li><li>strong knowledge of Android Architectural Components and Design Patterns</li><li>are good in pixel-perfect implementation of designs</li><li>are proficient with restful api to connect android applications to back-end services</li><li>strong debugging and root cause analysis skills alongside data structures</li><li>are constantly learning and looking for ways to improve yourself and the processes around you.</li><li>mentor and support other team members by doing code reviews and apply your experience in process and technical leadership.</li><li>work in agile team environments and are a self-starter, conscientious member of the team</li>"}],"text":"android developer","country":"IN","workplaceType":"onsite","hostedUrl":"https://jobs.lever.co/cred/f1b5843c-7a21-4747-8f08-3fa442aa7b9a","applyUrl":"https://jobs.lever.co/cred/f1b5843c-7a21-4747-8f08-3fa442aa7b9a/apply"},{"additionalPlain":"how is life at CRED? \n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role, you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee good company. \n\nhard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work. this is why CRED is in the continuous process of building an environment that helps the team rejuvenate itself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word.\n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div><b style=\"font-size: 11pt\">how is life at CRED?</b><span style=\"font-size: 11pt\">&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role, you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee good company.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">hard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work. this is why CRED is in the continuous process of building an environment that helps the team rejuvenate itself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and comprehensive health insurance.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word.</span></div><div><br></div><div><span style=\"font-size: 11pt\">there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</span></div>","categories":{"commitment":"full time","department":"operations","location":"Bengaluru, Karnataka","team":"Fraud & Risk - Chargeback"},"createdAt":1671000883319,"descriptionPlain":"what is CRED?  \n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.  \n\nCRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea is to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception.  to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.  \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? Answer: you get something close to what we have at CRED; CRED just has it better.  \n\nhere’s what will be in store for you at CRED once you join us as a chargeback investigator.\n\n","description":"<div><b style=\"font-size: 11pt\">what is CRED?</b><span style=\"font-size: 11pt\">&nbsp;</span>&nbsp;</div><div><br></div><div><span style=\"font-size: 11pt\">CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.&nbsp;</span>&nbsp;</div><div><br></div><div><span style=\"font-size: 11pt\">CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea is to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception.&nbsp;</span>&nbsp;<span style=\"font-size: 11pt\">to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</span>&nbsp;</div><div><br></div><div><span style=\"font-size: 11pt\">here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? Answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</span>&nbsp;</div><div><br></div><div><span style=\"font-size: 11pt\">here’s what will be in store for you at CRED once you join us as a chargeback investigator.</span></div><div><br></div>","id":"108ef1a0-fc77-4df3-90c4-9b768ba70cb8","lists":[{"text":"what will you do?","content":"<li>maintain or exceed established standards for customer service, and resolve complex issues with little or no supervision or direction</li><li>perform manual chargeback review in order to detect underlying business issues in products</li><li>review queued transactions and independently determine if the reviewed transactions are to be defended or accepted</li><li>liaison with banking partners and payment gateways to ensure the smooth and efficient processing of the chargeback disputes</li><li>conduct extensive research to validate transactions </li><li>independently resolve problems that require in-depth investigation and/or research</li><li>identify trends, emerging risks, and insights regarding chargeback investigations</li><li>collaborate closely with data science and risk teams to provide feedback on the observed fraud patterns as well as to create fraud prevention tools</li><li>developing measures for identifying and monitoring key risk indicators</li><div><br></div>"},{"text":"you should apply if you :","content":"<li>possess 3-5 years of experience in dispute management operations process</li><li>are able to build processes, systemic controls/alerts and implement best chargeback prevention practices</li><li>can effectively prioritizes work time to ensure productivity and fulfill department standards for time spent</li><li>can demonstrate ability to analyze problems logically</li><li>own an excellent ability to determine situational needs and provide appropriate solutions</li><li>have an ability to perform under pressure and manage multiple tasks and priorities independently</li><li>hold proficiency in SQL, MS office - word, excel and powerpoint applications</li><li>are self-disciplined, diligent, proactive and detail-oriented</li><li>have an excellent written and verbal communication skills</li><div><br></div>"}],"text":"chargeback analyst","country":"IN","workplaceType":"onsite","hostedUrl":"https://jobs.lever.co/cred/108ef1a0-fc77-4df3-90c4-9b768ba70cb8","applyUrl":"https://jobs.lever.co/cred/108ef1a0-fc77-4df3-90c4-9b768ba70cb8/apply"},{"additionalPlain":"how is life at CRED? \n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete,maybe a magician. at CRED people always have talent up their sleeves. with the right company,even conversations can be rejuvenating. at CRED, we guarantee a good company. \n\nhard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work.which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. \n\nsince trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. there are many more such eccentricities that make CRED what it is but that’s for one to discover. If you feel at home reading this, get in touch.\n\n","additional":"<div><b style=\"font-size: 11pt\">how is life at CRED?&nbsp;</b></div><div><br></div><div><span style=\"font-size: 11pt\">working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete,maybe a magician. at CRED people always have talent up their sleeves. with the right company,even conversations can be rejuvenating. at CRED, we guarantee a good company.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">hard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work.which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">to make things smoother and to make sure you spend time and energy only on the most important things,CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. there are many more such eccentricities that make CRED what it is but that’s for one to discover. If you feel at home reading this, get in touch.</span></div><div><br></div>","categories":{"commitment":"full time","department":"operations","location":"bengaluru","team":"Fraud & Risk - Chargeback"},"createdAt":1668961547541,"descriptionPlain":"about CRED: \n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. \na community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a part of the fraud and chargeback team.\n\n","description":"<div><b>about CRED: </b></div><div><br></div><div><span style=\"font-size: 11pt\">CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. </span></div><div><span style=\"font-size: 11pt\">a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</span></div><div><span style=\"font-size: 11pt\">here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">here’s what will be in store for you at CRED once you join as a part of the fraud and chargeback team.</span></div><div><br></div>","id":"72875824-fb10-44bf-9fa1-de019ec5fdba","lists":[{"text":"what will you do?","content":"<li>set-up process for chargeback process by ensuring end-to-end investigation is performed</li><li>conduct regular cadence with the finance, reconciliation and internal stakeholders to identify opportunities for improvement and effective representation of chargebacks and disputes raised</li><li>ability to identify patterns to determine the underlying causes of problems and handle it effectively</li><li>follow up with merchants for documentation and successfully defending the merchants from chargeback thru pro-active alerts and effective training</li><li>research and identify suspicious activity through comparative analysis to determine if the activity is normal or setup proactive steps to avoid further or potential loss</li><li>responsible for setting up scalable process along with preparing necessary documentation/SOPs</li><li>build relationships with partner banks and service level agreements with internal and external stakeholders</li><li>improve dispute reduction strategy and applies bank and card industry regulations and practices in resolving disputes</li><li>handle resolution of dispute inquiries from cardholders, financial institutions, merchants and internal departments</li><div><br></div>"},{"text":"you should apply, if you have:","content":"<li>5 - 8 years experience in managing issuing/acquiring banks chargeback process in compliance with Visa/MasterCard</li><li>experience in working with credit card processing systems, card processors, card networks, payment gateways and merchant transaction ecosystem</li><li>experience in managing team of 5-10 membershave technical understanding of chargeback processing systems and merchant chargebacks</li><li>excellent written and verbal communication skills&nbsp;exceptional stakeholder management</li><li>ability to perform under pressure and manage multiple tasks,teams and priorities independently</li><li>proficiency in SQL, MS office word, excel and powerpoint applications</li><div><br></div>"}],"text":"chargeback lead","country":"IN","workplaceType":"onsite","hostedUrl":"https://jobs.lever.co/cred/72875824-fb10-44bf-9fa1-de019ec5fdba","applyUrl":"https://jobs.lever.co/cred/72875824-fb10-44bf-9fa1-de019ec5fdba/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div>","categories":{"commitment":"full time","department":"infrastructure & security","location":"Bengaluru, Karnataka","team":"Security & Compliance - Security"},"createdAt":1641303437045,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a part of the team \n","description":"<div><b>what is CRED?</b></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.&nbsp;CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception.&nbsp;to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a part of the team&nbsp;</div>","id":"7848bd8b-09aa-4f3a-a06a-4c467016ecfa","lists":[{"text":"what you will do:","content":"<li>you will work on a diverse domain of information security across the organisation, most importantly infrastructure and data security</li><li>own the cloud security posture management program and concentrate efforts on continuous improvement of the cloud security configurations aligned to global standards like NIST 800-53, ISO 27001, Cloud Security Alliance, etc.&nbsp;</li><li>engineer and uplift adoption of PaaC (Policy as a Code) to continuous monitoring of risk configurations changes.</li><li>be responsible identifying security issues (external as well as internal), help stakeholders to mitigate and at frequent occasions build a solution around some of the complex problem statements implement/maintain security for cloud-based systems/applications in AWS</li><li>conduct security design/infrastructure reviews, security architecture reviews</li><li>translate product requirements into threat models and identifying privacy issues and data leaks</li><li>contribute to the building, operating and maintaining of the cloud security infrastructure to improve prevent, detect and response capabilities.&nbsp;</li><li>build scalable systems which enforce and monitor compliance with your secure baseline, rectify issues automatically and alert on problematic systems.</li><li>automate infrastructure security and develop/implement security automation to solve manual effort on a day-day basis</li><li>build in-house security frameworks to establish a state of art security culture inside tech</li><li>assist with creating security awareness and maintaining prudent security engineering culture within an organisation</li><li>enable compliance in teams and help them achieve some of the industry’s best practices (e.g. PCI DSS, ISO 27001)</li>"},{"text":"you should apply if you have:","content":"<li>2-9 years of experience in information security</li><li>proficiency in one or more of the programming languages (python, golang, bash)</li><li>a good understanding of cloud security and a background of working with AWS Security</li><li>the experience to perform automation using Terraform/Ansible/Docker/Kubernetes, and any one CI tools (e.g. Jenkins, CodePipeline, etc.)</li><li>an understanding of concepts like Zero Trust Architecture, defence in depth, SASE.</li><li>the ability to build packages from source code and secure Linux kernel.</li><li>knowledge on eBPF, AppArmour, seccomp, and/or SElinux at scale.</li><li>the drive to influence organisations and stakeholders by practising data-driven approach</li><li>a GitHub profile, blog or a conference presentation&nbsp;</li><li>the ability to be a go-to person and communicate effectively with stakeholders (engineers, product, business teams)</li><li>the zeal to be proactive in keeping yourself updated with security news/issues/breaches/tools/blogs on the internet</li>"}],"text":"cloud security engineer","country":"IN","workplaceType":"unspecified","hostedUrl":"https://jobs.lever.co/cred/7848bd8b-09aa-4f3a-a06a-4c467016ecfa","applyUrl":"https://jobs.lever.co/cred/7848bd8b-09aa-4f3a-a06a-4c467016ecfa/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. Since, trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. there are many more such eccentricities that make CRED what it is but that’s for one to discover. If you feel at home reading this, get in touch.\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. Since, trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. there are many more such eccentricities that make CRED what it is but that’s for one to discover. If you feel at home reading this, get in touch.</div>","categories":{"commitment":"full time","department":"partnerships","location":"bengaluru","team":"partnerships - Store commerce"},"createdAt":1671616367916,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n","description":"<div><b>what is CRED?</b></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div>","id":"d1f60aa7-3fb8-4163-abab-da331f9b94ce","lists":[{"text":"what will you do?","content":"<li>manage the inbound merchant onboarding funnel end to end to ensure the best in class onboarding experience for the merchants&nbsp;</li><li>continuously improve the merchant onboarding experience by building, improving and running the involved processes and building products required to ensure the same</li><li>build required guardrails and capabilities to ensure only best quality products curated for top 1% of India are onboarded on CRED Store</li><li>understand the category strategy in detail and build &amp; execute merchant acquisition plan in line with the category strategy to ensure category business objectives are met</li><li>help meet product and business requirements by leveraging relationships to drive results</li><li>build relationships and manage partnerships with new brands to crack exclusive offerings for CRED members specifically when the merchant is in incubation stage</li><li>keep up with innovation in the partner ecosystem to unlock growth opportunities</li>"},{"text":"you should apply if you:","content":"<li>have relevant experience of 3-6 years in business development/client acquisition, preferably in the consumer internet businesses</li><li>have product and process thinking</li><li>can work with ambiguity and helps in bringing clarity in his/her function</li><li>exhibit high level of communication skills, client relationship skills&nbsp;</li><li>have the ability to think and react in a high-energy, fast-paced environment</li><li>thrive in high ownership roles and can operate independently on tasks</li><li>hate taking no for an answer, but also know when it’s worth moving on</li>"}],"text":"CRED store - acquisitions","country":"IN","workplaceType":"onsite","hostedUrl":"https://jobs.lever.co/cred/d1f60aa7-3fb8-4163-abab-da331f9b94ce","applyUrl":"https://jobs.lever.co/cred/d1f60aa7-3fb8-4163-abab-da331f9b94ce/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realise one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.\n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realise one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div>","categories":{"commitment":"full time","department":"risk analytics","location":"Bengaluru, Karnataka","team":"risk analytics - lending"},"createdAt":1649428372337,"descriptionPlain":"what is CRED?\n \nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n \nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a part of the team\n\nCRED is the largest digital lender in the country today. we are rewriting the script on digital lending.  \nyou will apply your strategic and analytical skills to building the next generation of lending products in the country. you'll team up with world-class professionals to develop and test strategies that ultimately impact the bottom line and you will do it all in a collaborative environment that values your insight, encourages ownership, insists on compounding and rewards the audacious\n","description":"<div><b>what is CRED?</b></div><div>&nbsp;</div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.&nbsp;CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div>&nbsp;</div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a part of the team</div><div><br></div><div><span style=\"font-size: 11pt\">CRED is the largest digital lender in the country today. we are rewriting the script on digital lending.&nbsp;&nbsp;</span></div><div><span style=\"font-size: 11pt\">you will apply your strategic and analytical skills to building the next generation of lending products in the country. you'll team up with world-class professionals to develop and test strategies that ultimately impact the bottom line and you will do it all in a collaborative environment that values your insight, encourages ownership, insists on compounding and rewards the audacious</span></div>","id":"f0a48d06-fee9-47ef-8809-7347567bbb29","lists":[{"text":"what will you do?","content":"<li>own P&amp;L outcomes and develop business strategies that will drive growth, profitability, and competitive success for CRED in the face of shifting consumer and regulatory demands</li><li>work closely with world class product teams to develop and implement new product and pricing strategies for various lending products</li><li>lead product level modelling/ analytics to drive step-change improvements in credit risk performance by connecting drivers of future consumer credit trends to historical behaviour and test hypotheses using rigorous monitoring and analysis</li>"},{"text":"you should apply if you: ","content":"<li>have a proven track record of decision making and problem solving based on analytics </li><li>have conceptual thinking skills complemented by strong <b>quantitative orientation</b>, given that a large part of the business is based on rigorous analytic marketing &amp; credit risk management</li><li>have a successful track record of thriving in a fast paced, entrepreneurial and dynamic environment.&nbsp;&nbsp;</li><li>are a tenacious decision maker with the ability to bring a healthy, aggressive, yet responsible approach to business</li><li>have previous consulting or banking/investments or relevant credit risk experience (as a plus)</li>"}],"text":"credit strategy management","country":"IN","workplaceType":"unspecified","hostedUrl":"https://jobs.lever.co/cred/f0a48d06-fee9-47ef-8809-7347567bbb29","applyUrl":"https://jobs.lever.co/cred/f0a48d06-fee9-47ef-8809-7347567bbb29/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div>","categories":{"commitment":"full time","department":"infrastructure & security","location":"Bengaluru, Karnataka","team":"Security & Compliance - Security"},"createdAt":1653475723621,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a part of the team \n","description":"<div><b>what is CRED?</b></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.&nbsp;CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception.&nbsp;to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a part of the team&nbsp;</div>","id":"717ce3d0-7492-47db-bef7-c1d6f205c3a9","lists":[{"text":"what will you do:","content":"<li>you will work on a diverse domain of information security across the organization, most important data security and infrastructure security</li><li>will build and drive the data security program which includes data identification, data discovery, data mapping, data classification and data security practices and processes</li><li>get to perform PoC on tools and techniques available for implementing data security</li><li>drive the technical practices and implementation of securing data across technical systems and infrastructure</li><li>will develop, implement and manage security standards, plans/roadmaps, and operational processes to secure the AWS platform and resources such as Redshift, RDS, s3, etc</li><li>will implement technical measures or leverage existing technologies to prevent sensitive data from leaving the organization through email, messaging systems, network and cloud</li><li>you will evaluate data loss risks and conduct security assessments for services as per the project plan</li><li>part of the administration of the DLP tools which includes configuring policies and reporting</li><li>work with the internal teams for data security awareness campaigns</li><li>build in-house security frameworks to establish a state of art security culture inside the tech</li><li>assist with creating security awareness and maintaining prudent security engineering culture within an organization</li><li>enable compliance in teams and help them achieve some of the industry’s best practices (e.g. PCI DSS, ISO 27001)</li><div><br></div>"},{"text":"you should apply if you:","content":"<li>have 3-9 years experience in Information security and relevant exposure to managing data security/data protection policies for an organization</li><li>come with a good understanding of data security practices and hands-on experience of working with cloud infrastructure</li><li>have proficiency in one or more of the programming languages (python, golang, bash)</li><li>have a good understanding of the cloud and a background of working with AWS</li><li>have the ability to be a go-to person and communicate effectively with stakeholders (engineers, product, business teams)</li><li>have the drive to influence organizations and stakeholders by practicing data-driven approach</li><li>have experience with deploying DLP solutions and handling the DLP incident lifecycle</li><li>come with practical understanding of concepts like data anonymization or data tokenization</li><li>have exposure to different compliance standards and data protection legislations (GDPR/PDP)</li><li>have a GitHub profile, blog or a conference presentation</li><li>have the zeal to explore diverse domains of information security and have a fast learning curve</li><li>have the ability to be proactive in keeping yourself updated with security news/issues/breaches/tools/blogs on the internet</li><div><br></div>"}],"text":"data security","country":"IN","workplaceType":"unspecified","hostedUrl":"https://jobs.lever.co/cred/717ce3d0-7492-47db-bef7-c1d6f205c3a9","applyUrl":"https://jobs.lever.co/cred/717ce3d0-7492-47db-bef7-c1d6f205c3a9/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div><b style=\"font-size: 11pt\">how is life at CRED?</b></div><div><br></div><div><span style=\"font-size: 11pt\">working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</span></div><div><br></div><div><span style=\"font-size: 11pt\">hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</span></div>","categories":{"commitment":"full time","department":"infrastructure & security","location":"Bengaluru, Karnataka","team":"Infrastructure- Database"},"createdAt":1673883147907,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a database administrator.\n","description":"<div><b style=\"font-size: 11pt\">what is CRED?</b></div><div><br></div><div><span style=\"font-size: 11pt\">CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</span></div><div><span style=\"font-size: 11pt\">here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">here’s what will be in store for you at CRED once you join as a database administrator.</span></div>","id":"93c7e053-a7b1-4d7c-9975-318e6513cce5","lists":[{"text":"what will you do?","content":"<li>design, build, deploy and operate mission-critical infrastructure in a highly agile and scalable production environment</li><li>having a knack of tinkering around multiple large Terra Byte-sized open source relational databases and&nbsp; high throughput NoSQL datastores, serving tens of thousands of queries per second </li><li>dig deep into the internals of RDBMS and underlying operating systems and hardware</li><li>mission-critical database systems deployed on top of AWS EC2/RDS/Aurora and various NoSQL technologies</li><li>work closely with various stakeholders identifying their database requirements, guide them through the database technology and design choices, optimizing them for scale.</li><li>planning for organic and inorganic growth and the related operational requirements</li><li>continuous improvement of the operability and observability of the deployed database clusters </li><li>defining, evangelizing, and continuously improving the database best practices with various stakeholders</li>"},{"text":"you should apply If you have : ","content":"<li>over 7 -10 years of DBA experience in the software industry with RDS/MySQL/Percona(5.x) and NoSQL (Preferred)</li><li>working knowledge of PostgreSQL, and NoSQL datastores but not limited to (DynamoDB, Aerospike, MongoDB, Cassandra, ScyllaDB, and Elasticsearch)</li><li>good knowledge of Linux performance, memory management, I/O tuning, configuration, security, networking, clusters, and troubleshooting.</li><li>good skills in building tools and frameworks and documenting them which will ease your day-to-day life (preferably in Python)</li><li>timescaleDB, redis/Elasticache/MemDB database proxies including, but not limited to ProxySQL, Maxscale</li><li>CDC systems including but not limited to DMS, Debezium, Maxwell</li><li>database sharding (Vitess, Jepats)</li><li>deployment automation using Terraform, Cloudformation, Ansible, Chef</li><li>strong working knowledge of HA/DR best practice architecture.</li>"}],"text":"database administrator","country":"IN","workplaceType":"onsite","hostedUrl":"https://jobs.lever.co/cred/93c7e053-a7b1-4d7c-9975-318e6513cce5","applyUrl":"https://jobs.lever.co/cred/93c7e053-a7b1-4d7c-9975-318e6513cce5/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n\n","additional":"<div>how is life at CRED?</div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div><div><br></div>","categories":{"commitment":"internship","department":"infrastructure & security","location":"Bengaluru, Karnataka","team":"Infrastructure- Database"},"createdAt":1675838033665,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a DBA intern.\n","description":"<div><b style=\"font-size: 11pt\">what is CRED?</b></div><div><br></div><div><span style=\"font-size: 11pt\">CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">here’s what will be in store for you at CRED once you join as a DBA intern.</span></div>","id":"621767d5-6626-4d3f-a178-0ba1f538f2b0","lists":[{"text":"what will you do:","content":"<li>learn from a scalable, fault-tolerant and resilient cloud Database infrastructure at the world’s fastest-growing <a href=\"http://startup.design\">startup.</a></li><li><a href=\"http://startup.design\">design</a> and implement the ideal Database infrastructure roadmap backed by robust security and compliance plan </li><li>translate our business vision into a forward-looking secure scalable Data infrastructure strategy</li><li>work with an industry renowned team to be part of india’s best fintech infrastructure team</li>"},{"text":"you should apply if you have: ","content":"<li>0-6 months of experience and an interest in managing large, complex Database deployments / distributed systems&nbsp;</li><li>an interest in managing highly compliant financial services Database and ensure the continuance of compliance against pci-dss, iso:27001:2013, data-localization (RBI) and NPCI guidelines</li><li>curiosity to learn and understand the ecosystem around microservice architecture with regards to Data storage and retrieval.</li><li>learn/work with MySQL , Postgres, Amazon DynamoDB , Aerospike, Scylla , Elastic Search, Redis , Python, Golang, AWS, Amazon Aurora, Datadog, Prometheus, Grafana etc.</li>"}],"text":"database administrator intern","country":"IN","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/cred/621767d5-6626-4d3f-a178-0ba1f538f2b0","applyUrl":"https://jobs.lever.co/cred/621767d5-6626-4d3f-a178-0ba1f538f2b0/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div>how is life at CRED?</div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div>","categories":{"commitment":"full time","department":"engineering","location":"bengaluru","team":"Mobile- Central"},"createdAt":1606574749628,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a part of the team\n","description":"<div>what is CRED?</div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.&nbsp;CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception.&nbsp;to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a part of the team</div>","id":"5c1420bf-8f63-4243-87df-f520f277de60","lists":[{"text":"what will you do:","content":"<li>work on a disruptive product that’s still in its early stages</li><li>be responsible for the development and maintenance of the CRED app aimed at a vast number of diverse android / ios devices.</li><li>translate designs and wireframes into high-quality code</li><li>ensure the best possible performance, quality, and responsiveness of the CRED app</li><li>mentor other engineers, defining our technical culture and helping to build a fast-growing team</li>"},{"text":"you should apply if you:","content":"<li>possess 2-6 years of experience in product development, architecture, and design in either android or ios</li><li>have a minimum of 1 year experience in developing apps for either android / ios using Flutter</li><li>are experienced in flutter / dart, or have a strong desire to shift to flutter / dart</li><li>constantly learn and look for ways to improve yourself and the processes around you.</li><li>have a strong knowledge of android or ios sdk, different versions of android / ios, and know how to deal with different screen sizes</li><li>are proficient with restful api to connect android / ios applications to back-end services</li><li>have experience with storage, threading, and performance tuning</li><li>mentor and support other team members by reviewing codes and applying your experience in process and technical leadership</li><li>work in agile team environments and are a self-starter, conscientious member of the team.</li><li>ensure pixel-perfect implementation of designs</li>"}],"text":"flutter developer","country":"IN","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/cred/5c1420bf-8f63-4243-87df-f520f277de60","applyUrl":"https://jobs.lever.co/cred/5c1420bf-8f63-4243-87df-f520f277de60/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realise one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.\n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realise one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div><div><br></div>","categories":{"commitment":"full time","department":"risk analytics","location":"Bengaluru, Karnataka","team":"risk analytics - lending"},"createdAt":1641897209068,"descriptionPlain":"what is CRED?\n \nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n \nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a part of the team\n\n\n","description":"<div><b>what is CRED?</b></div><div>&nbsp;</div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div>&nbsp;</div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a part of the team</div><div><br></div><div><br></div>","id":"700b9c2c-fcf3-488a-9ca1-c8f0175b0a3d","lists":[{"text":"what you will do?","content":"<li>design and implement fraud prevention and detection policies</li><li>proactively build rules across different products to prevent fraud by analysing past fraud patterns in both industry and organisation</li><li>build safeguards or leading indicators to analyse any anomalies and utilise them in creating new rules and strategies wherever necessary</li><li>keep abreast of industry trends, competitive fraud policies, and maintain thorough &amp; current knowledge of changes in the field of fraud prevention</li><li>identify, measure, define and control fraud risk with respect to various operational processes&nbsp;</li><li>design the compliance controls, fraud review mechanism, and reporting requirements in compliance with the regulatory guidelines&nbsp;</li><li>design and write SOPs to lead fraud investigations and internal operational processes&nbsp;working along with product and engineering teams to develop real-time fraud detection and prevention rules on the platform across different lob's</li><div><br></div>"},{"text":"you should apply if you:","content":"<li>have 2-4 years prior work experience as an analyst in data-driven environments&nbsp;and possess strong technical skills such as sql or sas or r or python&nbsp;</li><li>have prior experience in fraud analytics in banks/NBFCs/fintechs can be an advantage, though not mandatory&nbsp;</li><li>have the ability and habit of learning and figuring out new methods, strategies to proactively identify potential loopholes in any process&nbsp;</li><li>have the ability to analyse and solve complicated problems, and distill that complexity into simple and concise communication&nbsp;</li><li>seek high ownership, independent environments, and feedback oriented cultures&nbsp;</li><li>are comfortable with ambiguity, believe in first principles, and have the skill to transform broad ideas into action plans</li>"}],"text":"fraud analytics","country":"IN","workplaceType":"unspecified","hostedUrl":"https://jobs.lever.co/cred/700b9c2c-fcf3-488a-9ca1-c8f0175b0a3d","applyUrl":"https://jobs.lever.co/cred/700b9c2c-fcf3-488a-9ca1-c8f0175b0a3d/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. \n\nat CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. \nif you feel at home reading this, get in touch.\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. </div><div><br></div><div>at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. </div><div>if you feel at home reading this, get in touch.</div>","categories":{"commitment":"full time","department":"engineering","location":"Bengaluru, Karnataka","team":"Frontend"},"createdAt":1668670654679,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.\n \nhere’s what will be in store for you at CRED once you join as a part of the team \n\n","description":"<div><b>what is CRED?</b></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception.&nbsp;to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.</div><div>&nbsp;</div><div>here’s what will be in store for you at CRED once you join as a part of the team&nbsp;</div><div><br></div>","id":"9b97183b-2d89-4d77-9c27-4ea62f5250e9","lists":[{"text":"what you will do?","content":"<li>work on a disruptive product that’s still in its early stages</li><li>be responsible to drive innovation in software development, while relentlessly improving performance, scalability, and maintainability.</li><li>owning the design process, implementation, and verification of framework components leveraging standard software engineering methodologies</li><li>translating functional and technical requirements into detailed architecture and design.</li>"},{"text":"you should apply if you:","content":"<li>posses 2 to 6 years of experience building high-performance consumer web applications.</li><li>extensive experience in javascript/typescript and with some of the modern web frameworks(React, svelte, vue)</li><li>experience with styling web applications and working with CSS frameworks like styled components, tailwind, etc.</li><li>good knowledge in frontend architecture principles and design patterns.</li><li>familiar with application performance, different web rendering strategies and caching techniques.</li><li>understanding of Node.js and frontend build tools.</li><li>keep up to date with current trends and the latest web standards.</li><li>attention to detail, obsession for pixel perfection and ability to convert a designer's vision to a working app.</li><li>have passion to code, but also you’re awesome at it!</li>"}],"text":"frontend developer","country":"IN","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/cred/9b97183b-2d89-4d77-9c27-4ea62f5250e9","applyUrl":"https://jobs.lever.co/cred/9b97183b-2d89-4d77-9c27-4ea62f5250e9/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realise one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.\n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realise one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div><div><br></div>","categories":{"commitment":"full time","department":"infrastructure & security","location":"Bengaluru, Karnataka","team":"Infrastructure & Security - Central"},"createdAt":1675756088896,"descriptionPlain":"what is CRED?\n \nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n \nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a part of the team\n","description":"<div><b>what is CRED?</b></div><div>&nbsp;</div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.&nbsp;CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div>&nbsp;</div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a part of the team</div>","id":"1a221a83-d25f-4ea0-a553-7310aa00e8c8","lists":[{"text":"what will you do?","content":"<li>responsible for strategic and operational ownership of all enterprise IT services and office infrastructure</li><li>partner with the security function to ensure security technology services, compliance standards, and processes are implemented and maintained.</li><li>partner with the HR function to ensure team members' lifecycle in IT systems is enhanced and required processes are established</li><li>responsible for forecasting annual IT budgets and partnering with the finance team to establish and implement transparent policies &amp; procedures</li><li>responsible for uptime of all office networks</li><li>develop and maintain relationships with internal and external partners to maximize value</li><li>measure and improve the eNPS and productivity of team members</li><li>responsible for creating annual roadmaps and quarterly check metrics for enterprise IT</li><li>help team members within the IT Team develop and nurture their skills and experience</li><li>help onboard a team of IT professionals focused on delivering a world-class experience to team members</li><li>build processes that enable team members to collaborate and execute</li>"},{"text":"you should apply if you: ","content":"<li>possess 10+ years experience of experience in information technology, leading and managing a global IT team in a high-growth technology company</li><li>are familiar with compliance and information security</li><li>have the knowledge of modern cloud technologies and&nbsp; SaaS (e.g., okta, AWS)</li><li>are highly process-oriented with project management skills</li><li>have a strong business acumen with the ability to understand business priorities, IT operations, and IT enablement potential</li><li>understand IT Service Management (ITSM) and the IT Infrastructure Library (ITIL) frameworks</li><li>are experienced in vendor management, budgeting, and capacity planning in a fast-growth environment</li><li>can be versatile with enterprise and office network setups.</li><li>drive change management knowledge and ability to operate effectively in a fast-paced environment</li>"}],"text":"head of enterprise IT","country":"IN","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/cred/1a221a83-d25f-4ea0-a553-7310aa00e8c8","applyUrl":"https://jobs.lever.co/cred/1a221a83-d25f-4ea0-a553-7310aa00e8c8/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div>","categories":{"commitment":"full time","department":"engineering","location":"Bengaluru, Karnataka","team":"Mobile - Ios"},"createdAt":1641303209388,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a part of the team \n\n","description":"<div><b>what is CRED?</b></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.&nbsp;CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception.&nbsp;to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a part of the team&nbsp;</div><div><br></div>","id":"f326d934-c6e4-4e87-a35f-fa0f68461084","lists":[{"text":"what you will do?","content":"<li>work on a disruptive product that’s still in its early stages</li><li>be responsible for the development and maintenance of the CRED App aimed at ios mobile devices.</li><li>translate designs and wireframes into high-quality code</li><li>ensure the best possible performance, quality, and responsiveness of the CRED App</li><li>mentor other engineers, define our technical culture and help to build a fast-growing team.</li>"},{"text":"you should apply if you:","content":"<li>possess 1+ years of experience in product development, architecture, and design </li><li>experienced in swift, or have a strong desire to shift to swift </li><li>strong understanding of algorithms </li><li>have strong knowledge of iOS frameworks, different versions of iOS, and know how to deal with different screen sizes</li><li>have experience with storage, threading, and performance tuning </li><li>strong knowledge of iOS architectural components and design patterns </li><li>are good in pixel-perfect implementation of designs </li><li>deep understanding of memory management, multi-threaded programming, and synchronization</li><li>strong debugging and root cause analysis skills alongside data structures </li><li>Familiarity with designing and developing Core OS frameworks  </li><li>mentor and support other team members by doing code reviews and apply your experience in process and technical leadership</li><li>work in agile team environments and are a self-starter, conscientious member of the team.</li>"}],"text":"iOS developer","country":"IN","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/cred/f326d934-c6e4-4e87-a35f-fa0f68461084","applyUrl":"https://jobs.lever.co/cred/f326d934-c6e4-4e87-a35f-fa0f68461084/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div>","categories":{"commitment":"full time","department":"infrastructure & security","location":"Bengaluru, Karnataka","team":"Security & Compliance - Compliance"},"createdAt":1641303388541,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behaviour. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea is to create a community centred around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behaviour to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join.\n","description":"<div><b>what is CRED?</b></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behaviour. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea is to create a community centred around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behaviour to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join.</div>","id":"53249cd6-fe77-4ede-a59c-09bf1baa0287","lists":[{"text":"what will you do:","content":"<li>you will work and establish credibility with groups involved with payment security and compliance matters (InfoSec, legal, business development, internal audit, fraud, physical security, developer community, networking, systems, etc.).</li><li>you will maintain documentation for security compliance including but not limited to PCI-DSS, RBI PSS, ITGC, ISO27001, card brands (Visa, Mastercard), etc.</li><li>you will review new / modifications of products and processes. should provide functional support to internal departments in areas of compliance with regulatory bodies, and dissemination of circulars issued by regulators.</li><li>you will collaborate with business/service teams to implement compliance plans in developing risk registers covering various activities of the FinTech company.</li><li>you will identify and support opportunities for improving third-party risk posture and processes, including expanded monitoring, KRI tracking, etc. by applying knowledge of security, regulatory, and third-party risk lifecycle frameworks.</li><li>you will remain up to date on laws applicable to IT security of the organization and update policies accordingly.</li><li>you will understand and rationalize compliance requirements in the payment domains.</li><div><br></div>"},{"text":"you should apply if you:","content":"<li>have 2-5 years of relevant industry experience including information assurance, data privacy, and compliance.</li><li>have CISA or other information security-related certification will be preferred.</li><li>have an experience in IT &amp; Cyber Security risk as well as regulatory risk requirements. knowledge of periodic evaluation and review of the effectiveness of information security policies, procedures, standards, and processes.</li><li>have the ability to be a go-to person and communicate effectively with stakeholders (engineers, product, business teams)</li><li>have the drive to influence organizations and stakeholders by practicing a data-driven approach</li><li>have exposure to different regulatory compliance standards related to the payments ecosystem</li><div><br></div>"}],"text":"IT risk & compliance - secure by design","country":"IN","workplaceType":"unspecified","hostedUrl":"https://jobs.lever.co/cred/53249cd6-fe77-4ede-a59c-09bf1baa0287","applyUrl":"https://jobs.lever.co/cred/53249cd6-fe77-4ede-a59c-09bf1baa0287/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div>","categories":{"commitment":"full time","department":"risk analytics","location":"Bengaluru, Karnataka","team":"risk analytics - lending"},"createdAt":1641365950314,"descriptionPlain":"what is CRED?\n\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a part of the team\n","description":"<div><b>what is CRED?</b></div><div><br></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.&nbsp;CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception.&nbsp;to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a part of the team</div>","id":"0c0fc4d8-379a-4e3d-a5c2-908d60883c1e","lists":[{"text":"what you will do?","content":"<li>build credit risk models and make credit decisions.</li><li>develop, implement and monitor risk strategies cutting across credit underwriting, limit assessment, pricing, line management, and collections</li><li>identify and evaluate alternate data features to find credit expansion opportunities</li><li>craft automated dashboards to track metrics on risk strategy and portfolio performance</li><li>set up a robust monitoring and alerting systems on early warning signals to drive agility in decision making</li><li>help shape the product design and operations processes by evaluating them from a credit risk lens</li><li>help shape the omni-channel collections treatment strategy so that we maximize our use of analytics &amp; technology to optimize collections efficiency</li><li>work closely with collections to ensure the feedback loop is closed and learnings are relayed into our credit decisioning strategies</li>"},{"text":"you should apply if you:","content":"<li>have 1-3 years prior work experience as an analyst in data-driven environments. prior experience in risk analytics is preferred but not mandatory</li><li>have the ability to analyze and solve complicated problems, and distill that complexity into simple and concise communication.</li><li>possess strong technical skills such as sqlL/sas/r/python</li><li>have experience with bi/data visualization tools (like Tableau or metabase to create dashboards)</li><li>are comfortable with ambiguity, believe in first principles and have the skill to transform broad ideas into action plans</li><li>seek high ownership, independent environments, and feedback oriented cultures</li>"}],"text":"lending analytics","country":"IN","workplaceType":"unspecified","hostedUrl":"https://jobs.lever.co/cred/0c0fc4d8-379a-4e3d-a5c2-908d60883c1e","applyUrl":"https://jobs.lever.co/cred/0c0fc4d8-379a-4e3d-a5c2-908d60883c1e/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div><div><br></div>","categories":{"commitment":"full time","department":"engineering","location":"Bengaluru, Karnataka","team":"Quality Engineering - Mobile"},"createdAt":1641303484103,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. \n\nCRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. A community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. \n\nto build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? Answer: You get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a QA Engineer. \n\n","description":"<div><b>what is CRED?</b></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.&nbsp;</div><div><br></div><div>CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. A community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception.&nbsp;</div><div><br></div><div>to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? Answer: You get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a QA Engineer.&nbsp;</div><div><br></div>","id":"4d18b391-438a-4c6e-bcd3-d22b66976d8a","lists":[{"text":"What will you do:","content":"<li>work on a disruptive product that’s still in its early stages</li><li>review functional and design specifications to ensure a complete understanding of the system</li><li>own end-to-end system and all requirements, issues, and enhancements to closure single-handedly.</li><li>establish predictability and notify stakeholders about any delays, changes in release cycles, sprint plan, etc.</li><li>mentor other engineers, defining our technical culture and helping us to build a fast-growing team.</li>"},{"text":"you should apply if you have:","content":"<li>possess 2-6 years of experience as a qa engineer.</li><li>have strong organizational and problem-solving skills with great attention to detail, critical thinking, debugging, solid communication, with the ability to track multiple test executions simultaneously and report results.</li><li>have prior experience in creating optimal test strategy (including functional, nonfunctional, analytics, and automation) and test plans for both short-term and long-term projects.</li><li>have strong hands-on experience in functional and non-functional testing of mobile applications (both ios and android)</li><li>have knowledge of test methodology and tools, software testing standards, methods and conventions, build systems, and the product development cycle.</li><li>possess the ability to handle independent execution with minimal guidance.</li><li>have experience in project management tools like jira, testrail.</li><li>are sharp analytically, have proven design skills, excellent communication skills.&nbsp;</li>"}],"text":"mobile QA engineer","country":"IN","workplaceType":"onsite","hostedUrl":"https://jobs.lever.co/cred/4d18b391-438a-4c6e-bcd3-d22b66976d8a","applyUrl":"https://jobs.lever.co/cred/4d18b391-438a-4c6e-bcd3-d22b66976d8a/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div>","categories":{"commitment":"full time","department":"infrastructure & security","location":"Bengaluru, Karnataka","team":"Infrastructure & Security - Central"},"createdAt":1640092394863,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behaviour. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea is to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behaviour to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a security engineer.\n","description":"<div><b>what is CRED?</b></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behaviour. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea is to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behaviour to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a security engineer.</div>","id":"9aa7fccf-5bfb-4b89-bd10-e4e0caf1dae9","lists":[{"text":"what you will do:","content":"<li>perform security assessments of Android and iOS mobile applications.</li><li>exploit security flaws and vulnerabilities with Proof of Concept (POC) on both mobile platforms</li><li>ability to conduct black box/white box penetration tests.</li><li>research in emerging technologies and maintain awareness of latest security risks.</li><li>closely work with product and engineering teams across the organization to understand and secure new product features by involving right from the design walkthrough to full code review.</li><li>proactively review and identify vulnerabilities across our platform and recommend fixes.</li><li>identify automation opportunities and develop scripts with instrumentation frameworks for various security test cases</li><li>research on cutting edge technologies and topics in mobile security and prepare POCs</li><li>contribute to in-house mobile security projects and tools and present them at conferences</li>"},{"text":"you should apply if :","content":"<li>you come with 2 - 8 years of experience in Application Security</li><li>you have in-depth understanding of security vulnerabilities in Android and iOS.</li><li>you are experienced in doing security assessments on core Android components based on business use-cases</li><li>you can be the go-to person and could communicate effectively with stakeholders (engineers, product, business teams) on anything related to mobile application security</li>"}],"text":"mobile security engineer","country":"IN","workplaceType":"unspecified","hostedUrl":"https://jobs.lever.co/cred/9aa7fccf-5bfb-4b89-bd10-e4e0caf1dae9","applyUrl":"https://jobs.lever.co/cred/9aa7fccf-5bfb-4b89-bd10-e4e0caf1dae9/apply"},{"additionalPlain":"how is life at CRED? \n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company. \n\nhard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.  \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div><b style=\"font-size: 11pt\">how is life at CRED?</b><span style=\"font-size: 11pt\">&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">hard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</span></div>","categories":{"commitment":"consultant","department":"partnerships","location":"Bengaluru, Karnataka","team":"partnerships - Store commerce"},"createdAt":1667980351072,"descriptionPlain":"what is CRED? \n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.  \n\nCRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.  \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.  \n\nhere’s what will be in store for you at CRED once you join the store team\n\n","description":"<div><b style=\"font-size: 11pt\">what is CRED?</b><span style=\"font-size: 11pt\">&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.&nbsp;</span>&nbsp;</div><div><br></div><div><span style=\"font-size: 11pt\">CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</span>&nbsp;</div><div><br></div><div><span style=\"font-size: 11pt\">here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</span>&nbsp;</div><div><br></div><div><span style=\"font-size: 11pt\">here’s what will be in store for you at CRED once you join the store team</span></div><div><br></div>","id":"2a15f505-d6cf-4238-b167-bdf9e5513f37","lists":[{"text":"what will you do?","content":"<li>structure, negotiate and execute partnership deals with various brands and organizations across categories like F&amp;B, beauty, electronics, home furnishings and apparel</li><li>work with the business team on the category strategy to identify and curate the right selection of D2C ecommerce brands and products for the platform</li><li>work with brand partners to crack the best curation of products for CRED store's premium users</li><li>track performance of products with various data tools to identify and analyze trends for optimizing sales volumes</li><li>identify top products and get best in class offers for special event days as well as regular business days on store</li><li>manage brand onboarding and ensure timely and unerring product listings for the selected curation from the brand in liaison with the merchandising team</li><li>coordinate with all operations teams including product fulfillment, customer support and finance teams to ensure smooth functioning of category and best partner experience</li>"},{"text":"you should apply if you:","content":"<li>possess 1-4 years of work experience preferably in e-commerce, partnerships and/or operations</li><li>have excellent communication skills both written and spoken</li><li>have a knack for partnerships, negotiations, and stakeholder management</li><li>come with a hunger to learn about and develop e-commerce business</li><li>are comfortable with very dynamic business environments which change rapidly and demand resilience and problem solving abilities</li><li>are proficient with data handling and excel - pivot tables, v-lookup, shortcuts etc. (macros - good to have)</li><li>exhibit high organizing ability, proactiveness and attention to detail</li><li>have the ability to multitask and manage multiple projects and stakeholders simultaneously</li><div><br></div>"}],"text":"partnerships consultant - CRED store","country":"IN","workplaceType":"onsite","hostedUrl":"https://jobs.lever.co/cred/2a15f505-d6cf-4238-b167-bdf9e5513f37","applyUrl":"https://jobs.lever.co/cred/2a15f505-d6cf-4238-b167-bdf9e5513f37/apply"},{"additionalPlain":"how is life at CRED?\n \nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee good company.\n \nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n \nto make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our team members get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n \nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n\n","additional":"<div>how is life at CRED?</div><div>&nbsp;</div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee good company.</div><div>&nbsp;</div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div>&nbsp;</div><div>to make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our team members get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div>&nbsp;</div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div><div><br></div>","categories":{"commitment":"full time","department":"talent & culture","location":"Bengaluru, Karnataka","team":"Culture - Business Partnership"},"createdAt":1670999345176,"descriptionPlain":"what is CRED? \n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \nwhat are the products at CRED ?\n\nhere’s what will be in store for you at CRED once you join as a  talent partner \n\n","description":"<div><span style=\"font-size: 12pt\">what is CRED?</span>&nbsp;</div><div><br></div><div><span style=\"font-size: 11pt\">CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</span></div><div><span style=\"font-size: 11pt\">what are the products at CRED ?</span></div><div><br></div><div><span style=\"font-size: 11pt\">here’s what will be in store for you at CRED once you join as a&nbsp; talent partner&nbsp;</span></div><div><br></div>","id":"91ba3a71-c03b-4ef1-bfa5-a256965285ba","lists":[{"text":"what you will do?","content":"<li>drive and focus on high-performance culture and support the lending leaders on building an organization that lives CRED values every day at work</li><li>strategic partnership with leadership in shaping talent upskilling and continuous improvement initiatives that help achieve high-performing engaged teams.</li><li>anchor discussions with the business to provide insights for enhancing team engagement and people development</li><li>drive inputs and own mechanisms that drive leadership accountability towards building a people-first organization</li><li>influence and drive change through data, identify problem areas and build effective and data-driven solutions</li><li>partner with business and talent team to drive org and talent needs, run mechanisms that include but are not limited to Abby and compensation planning</li><li>work with teams and look at enhancing lifecycle experience for team members and be seen as a go-to person for all facets of talent development</li><li>partner with the people operations team and support a roadmap for people technology and people process automation toward providing seamless service delivery and experience for our team members</li><div><br></div>"},{"text":"you should apply if you:","content":"<li>4-7 years of experience in a people-centric role such as business partnering and/or&nbsp; talent management preferably in a start-up environment</li><li>proven ability to understand business needs and translate them into organizational priorities, champion adoption of people mechanisms&nbsp;</li><li>proven track record in managing diverse team pools with evident improvement in culture and organizational behavior through sound people practices and programs</li><li>excellent interpersonal skills and ability to manage multiple stakeholders on diversified asks</li><li>comfort working in a fast-paced environment with competing priorities and an ambiguous yet creative and collaborative work environment</li><li>have exposure to global best practices in high-talent-density environments is a plus</li><li>are hungry to constantly learn and look for ways to improve yourself and the processes around you</li><li>have a solid understanding, passion to build/invent and experience delivering HR/People technology programs and roadmaps</li><div><br></div>"}],"text":"people business partner","country":"IN","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/cred/91ba3a71-c03b-4ef1-bfa5-a256965285ba","applyUrl":"https://jobs.lever.co/cred/91ba3a71-c03b-4ef1-bfa5-a256965285ba/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.\nto make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. If you feel at home reading this, get in touch.\n","additional":"<div><b style=\"font-size: 11pt\">how is life at CRED?</b></div><div><br></div><div><span style=\"font-size: 11pt\">working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</span></div><div><br></div><div><span style=\"font-size: 11pt\">hard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.</span></div><div><span style=\"font-size: 11pt\">to make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. </span></div><div><br></div><div><span style=\"font-size: 11pt\">there are many more such eccentricities that make CRED what it is but that’s for one to discover. If you feel at home reading this, get in touch.</span></div>","categories":{"commitment":"full time","department":"operations","location":"Bengaluru, Karnataka","team":"process excellence"},"createdAt":1670929546813,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. \n\nCRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.\n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.\n\nhere is what you will do when you join as a part of the team\n\n","description":"<div><b style=\"font-size: 11pt\">what is CRED?</b></div><div><br></div><div><span style=\"font-size: 11pt\">CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.</span></div><div><br></div><div><span style=\"font-size: 11pt\">here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.</span></div><div><br></div><div><span style=\"font-size: 11pt\">here is what you will do when you join as a part of the team</span></div><div><br></div>","id":"6c31326a-8fd9-4f42-9187-adb81cd1dedc","lists":[{"text":"what will you do?","content":"<li>design customer flows over chatbot to deliver the right experience for consumers</li><li>build feedback mechanism to continuously enhance bot algorithms based on the analysis</li><li>bring out maximum efficiency of internal tools (ticketing/CRM) to provide required information and action access to all stakeholders</li><li>design/derive metrics to monitor contact center performances such as login hours, AHT, aux time, wait time, etc.</li><li>continuously evaluate and re-engineer processes to provide best in class resolution and increase in FTR</li><li>focus on developing and implementing a strong foundation of processes, systems, measurements, and controls that can help deliver high performance consistently</li><li>lead process improvement projects that are medium and large in complexity, impact and scale that deliver results against defined KPIs and departmental goals</li><li>participate in the creation and execution of process improvement mechanisms across the customer experience platforms, including CRM, chatbot, etc</li><li>building efficient workflows for ticketing to ensure end to end lifecycle view of tickets through data</li><li>build an operating plan for CS in terms of planning and strategy</li><li>work with product to solve \"fundamental issues\" leading to contacts and have a clear roadmap</li><li>set up proactive monitoring process : work with various operating and product functions to receive alerts for leakages within the customer journey and communicate effectively to minimize reason for contact&nbsp;</li><li>setting up a strong VOC mechanism and seek inputs received through various channels : Email, Chat, SAT survey, NPS, social media channels&nbsp;</li><div><br></div>"},{"text":"you should apply if you:","content":"<li>possess prior experience of 4 to 5 years in the process excellence role with hands on work done on reduction in contacts, improving experience &amp; efficiency of CS</li><li>have good communication skills</li><li>have good analytical and problem-solving skills</li><li>can regularly demonstrate strong critical thinking and are good at real time decision-making</li><li>are comfortable working with multiple stakeholders and teams to drive the desired level of performance</li><div><br></div>"}],"text":"process excellence specialist","country":"IN","workplaceType":"onsite","hostedUrl":"https://jobs.lever.co/cred/6c31326a-8fd9-4f42-9187-adb81cd1dedc","applyUrl":"https://jobs.lever.co/cred/6c31326a-8fd9-4f42-9187-adb81cd1dedc/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realise one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.\n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realise one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div><div><br></div>","categories":{"commitment":"full time","department":"analytics","location":"Bengaluru, Karnataka","team":"product analytics"},"createdAt":1641303277741,"descriptionPlain":"what is CRED?\n \nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n \nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a part of the team\n\n","description":"<div><b>what is CRED?</b></div><div>&nbsp;</div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.&nbsp;CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div>&nbsp;</div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a part of the team</div><div><br></div>","id":"8eab9be0-0fc3-443a-b9bd-f0621a38a6bc","lists":[{"text":"what will you do?","content":"<li>develop sound understanding of the product/business/user – translating to a consumer first thinking within the right product/business context</li><li>effectively translate product/business issues to structured analytical problems with well-defined outcomes</li><li>conduct in-depth analysis for structured and unstructured analytical problems to unlock actionable insights</li><li>liaise with the business/product function to land the insights and influence decisions</li><li>create a consistent, objective, accurate and robust measurement framework for the business function</li><li>create smart solutions for recurring use cases through automation/self-serve platforms</li><li>manage stakeholders’ expectations to develop a partnering relationship</li>"},{"text":"you should apply if you: ","content":"<li>have relevant industry experience of 1 to 6 Years in product/business analytics</li><li>have strong first principle thinking - creative and structured thinking to solve real-world problems</li><li>are comfortable working with large datasets and extremely proficient in SQL or any relational database; alternatively, R/Python skills are good to have</li><li>prior working knowledge of any visualization tool such as Tableau, MSTR, etc.</li><li>possess great collaboration skills with the ability to work cross-functionally</li><li>have good organizational skills for prioritizing and time management with the ability to communication effectively and set right expectations on deliverables/timelines</li><li>have high sense of ownership, comfortable working in a high energy, fast paced environment</li>"}],"text":"product analytics","country":"IN","workplaceType":"onsite","hostedUrl":"https://jobs.lever.co/cred/8eab9be0-0fc3-443a-b9bd-f0621a38a6bc","applyUrl":"https://jobs.lever.co/cred/8eab9be0-0fc3-443a-b9bd-f0621a38a6bc/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n\n\n","additional":"<div><b style=\"font-size: 10.5pt\">how is life at CRED?</b></div><div><br></div><div><span style=\"font-size: 10.5pt\">working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</span></div><div><br></div><div><br></div>","categories":{"commitment":"full time","department":"design","location":"bengaluru","team":"Product Experience"},"createdAt":1593254443038,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\n","description":"<div>what is CRED?</div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div>","id":"f432646f-e11d-43aa-a8f0-909048e63297","lists":[{"text":"what you will do?","content":"<li>join the ranks of the disruptive product design team, where you'll help mature our fintech and lifestyle solution</li><li>drive innovation in interaction design, while also focusing on performance and scalability</li><li>think outside the box and bring first-principle thinking</li><li>paint a vision for new concepts, design trends, and take an obsessive approach to detail</li><li>partner with product management and engineering to deliver a seamless customer experience, and work with the larger design team to ensure coherence across the end-to-end experience</li><li>take ownership of your function, from delivery planning to vision-casting, and everything in between.</li>"},{"text":"you should apply if you:","content":"<li><b>visual flair :</b> we're looking for someone who can take a project from bland to beautiful, and has a keen eye for colour, typography, and composition.</li><li><b>a taste for adventure :</b> we're not talking about bungee jumping here (although that would be pretty cool). We're talking about taking design risks and pushing boundaries to create products that are truly unique and visually stunning.</li><li><b>artistic taste :</b> you know what looks good, and you have a natural sense for what will resonate with our users. you're always looking for new and innovative ways to push the boundaries of design.</li><li><b>user first thinking :</b> you understand that design is not just about making things look pretty, it's about solving real problems for real people. you have a deep understanding of user needs, and you use that knowledge to inform every design decision you make.</li><li><b>business acumen :</b> you know that design is not just about art, it's about creating products that meet the needs of the business. You have a deep understanding of the business landscape, and you know how to create designs that drive results.</li><li><b>a sense of humour :</b> life's too short to be serious all the time. we want someone who can bring a light, quirky, and fun perspective to their work and our office. bonus points if you can design a smiley face into our next product.</li><div><br></div><div>we're looking for a designer who thrives in ambiguity, and design solutions that are equally thoughtful, elegant, and delightful. you play well with others, but you aren't afraid to stand up for what you think is right. you're diplomatic and flexible while seeing the big picture, but you also find satisfaction in making every detail right. you partner with product management and engineering to deliver a great customer experience and also work with the bigger design team to ensure the overall end-to-end experience is coherent. to be successful in this role, you'll need to be someone with a dedicated mindset towards making things happen.&nbsp;</div><div><br></div><div><b>So, if you're ready to join the family of mafias and help create a utopia, we'd love to hear from you!</b></div>"}],"text":"product designer","country":"IN","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/cred/f432646f-e11d-43aa-a8f0-909048e63297","applyUrl":"https://jobs.lever.co/cred/f432646f-e11d-43aa-a8f0-909048e63297/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div>","categories":{"commitment":"full time","department":"engineering","location":"Bengaluru, Karnataka","team":"Quality Engineering - Backend"},"createdAt":1641303283397,"descriptionPlain":"what is CRED?\n\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a backend SDET.\n\n","description":"<div><b style=\"font-size: 11pt\">what is CRED?</b></div><div><br></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a backend SDET.</div><div><br></div>","id":"d04698b5-6b24-4abe-85e4-34333fe4a84b","lists":[{"text":"what will you do?","content":"<li>working on a disruptive product that is still in its early stages</li><li>review functional and design specifications to ensure a complete understanding of the system</li><li>taking ownership of the end-to-end system and taking all requirements, issues, and enhancements to closure single-handedly</li><li>develop and maintain the automation framework and scripts for regression and continuous integrationMentoring other engineers, defining our technical culture, and helping to build a fast-growing team </li>"},{"text":"you should apply if you have: ","content":"<li>3-6 years of experience as a software development engineer in test.</li><li>backend/API testing experience with strong basics and understanding about backend systems</li><li>prior experience in devising optimal test strategy (including functional, non functional, analytics and automation) and test plans for short term and long term projects</li><li>strong hands on experience on functional and non functional testing of backend applications</li><li>prior experience in creating test automation frameworks and self serve tools</li><li>experience in API automation</li><li>strong experience and base in object-oriented design and development</li><li>experience with relational databases and SQL queries.</li><li>sharp analytical abilities, proven design skills, excellent communication skills</li><li>experience handling the independent execution with minimal guidance</li><li>prior hands on experience or understanding on working with elasticsearch, redshift, datadog, AWS, kibana</li>"}],"text":"SDET - backend","country":"IN","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/cred/d04698b5-6b24-4abe-85e4-34333fe4a84b","applyUrl":"https://jobs.lever.co/cred/d04698b5-6b24-4abe-85e4-34333fe4a84b/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div><div><br></div>","categories":{"commitment":"full time","department":"engineering","location":"Bengaluru, Karnataka","team":"Quality Engineering - Mobile"},"createdAt":1641303571604,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\n\nhere’s what will be in store for you at CRED once you join as a frontend SDET. \n\n","description":"<div><b>what is CRED?</b></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.&nbsp;CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception.&nbsp;to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div><br></div><div>here’s what will be in store for you at CRED once you join as a frontend SDET.&nbsp;</div><div><br></div>","id":"ec653cdd-9bc6-46ea-a061-90818a12fb2d","lists":[{"text":"what will you do?","content":"<li>working on a disruptive product that’s still in its early stages</li><li>review functional and design specifications to ensure a complete understanding of the system.</li><li>taking ownership of the end-to-end system and taking all requirements, issues, and enhancements to closure single-handedly.</li><li>develop and maintain the automation framework and scripts for regression and continuous integration</li><li>mentoring other engineers, defining our technical culture, and helping to build a fast-growing team.</li><div><br></div>"},{"text":"you should apply if you:","content":"<li>possess 3+ years of experience as a software development engineer in test.</li><li>have mobile testing experience with strong basics, understand about the mobile os and excellent debugging skills.</li><li>have prior experience in creating optimal test strategy (including functional, non functional, analytics and automation) and test plans for short term and long term projects both.</li><li>have strong hands on experience on functional and non functional testing of mobile applications (both ios and android)</li><li>have prior experience in creating test automation frameworks and self serve tools.</li><li>have experience in mobile automation (android &amp; ios) using espresso, xcuitest and appium.&nbsp;</li><li>have experience in Java with strong base in object-oriented design and development.</li><li>experience with relational databases and sql queries</li><li>have the ability to handle the independent execution with minimal guidance</li><li>have experience in project management tools like jira, rallydev, fogbugz.</li><li>have sharp analytical abilities, proven design skills, excellent communication skills.</li>"},{"text":"good to have: ","content":"<li>prior experience in selenium web driver</li><li>prior hands on experience or understanding on working with elasticsearch ,redshift, datadog, aws, kibana</li>"}],"text":"SDET - mobile","country":"IN","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/cred/ec653cdd-9bc6-46ea-a061-90818a12fb2d","applyUrl":"https://jobs.lever.co/cred/ec653cdd-9bc6-46ea-a061-90818a12fb2d/apply"},{"additionalPlain":"how is life at CRED? \n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, athlete, or maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company. hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and comprehensive health insurance.  to make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.  there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div><b>how is life at CRED?</b>&nbsp;</div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, athlete, or maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.&nbsp;hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and comprehensive health insurance.&nbsp;&nbsp;to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;&nbsp;there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div>","categories":{"commitment":"full time","department":"infrastructure & security","location":"Bengaluru, Karnataka","team":"Security & Compliance - Compliance"},"createdAt":1668667755492,"descriptionPlain":"what is CRED?\n \nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behaviour. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea is to create a community centred around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behaviour to create a utopia where being trustworthy is the norm and not the exception to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n \nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.\n \nhere’s what will be in store for you at CRED once you join.\n\n","description":"<div><b>what is CRED?</b></div><div>&nbsp;</div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behaviour. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea is to create a community centred around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behaviour to create a utopia where being trustworthy is the norm and not the exception to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div>&nbsp;</div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.</div><div>&nbsp;</div><div>here’s what will be in store for you at CRED once you join.</div><div><br></div>","id":"9269dab2-8087-4604-bf1a-cf3b6feb8fa4","lists":[{"text":"what will you do?","content":"<li>you will conduct risk assessments of our internal processes and technologies to identify and report risks as per our risk management framework</li><li>you will act as a liaison between various teams and vendors to remediate risks and track them as per corresponding risk treatment options</li><li>you will review and improve on existing policies &amp; standards based on changing regulatory landscape, known issues, and expected risk posture within the organization</li><li>you will provide recommendations to businesses on potential risk scenarios and identify corresponding cost-benefit solutions in order to enable business</li><li>you will present executive reports to management on current risk postures, and potential risks beyond appetite to senior management</li><li>you will work with internal security team members to derive a standard controls framework in order to manage compliance and risks centrally</li><li>you will provide inputs to improve internal processes and tools including frameworks, in-house automation, etc.</li><li>you will be building risk awareness by providing necessary training within the company</li><li>you will support tooling and automation initiatives to attain a matured GRC state.</li><div><br></div>"},{"text":"you should apply if you:","content":"<li>have industry experience of 2-5 years in information security (preferably governance, risk management and compliance domain within FinTech organizations/payment ecosystem)</li><li>certifications such as ISO 27001 LI / LA, CISSP, CISA, CISM, etc. will be preferred</li><li>are thorough with the understanding of framework, methodologies, and best practices of risk management</li><li>proficiency in Atlassian tools (Jira / Confluence), Google suite and reporting tools such as Power BI / Tableau will be preferred</li><li>have excellent verbal / written communication skills, analytical skills, problem solving, and critical thinking skills</li><li>have excellent attention to detail while performing assessments with a willingness to improve on technical skills</li><li>have negotiation skills and the ability to influence key stakeholders</li><li>have a proactive approach to work, in terms of suggesting changes and improvements to processes and systems</li><div><br></div>"}],"text":"security risk management analyst","country":"IN","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/cred/9269dab2-8087-4604-bf1a-cf3b6feb8fa4","applyUrl":"https://jobs.lever.co/cred/9269dab2-8087-4604-bf1a-cf3b6feb8fa4/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div><div><br></div>","categories":{"commitment":"full time","department":"infrastructure & security","location":"Bengaluru, Karnataka","team":"Infrastructure - Site Reliability"},"createdAt":1641303250452,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a site reliability engineer.\n\n","description":"<div><b>what is CRED?</b></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a site reliability engineer.</div><div><br></div>","id":"660cc862-3cc9-4c52-9ed8-ebb136c3711d","lists":[{"text":"what you will do?","content":"<li>improve our scalable, fault-tolerant and resilient cloud infrastructure at the world’s fastest-growing startup.</li><li>design / implement the ideal infrastructure roadmap backed by robust security and compliant plan</li><li>translate our business vision into a forward-looking secure scalable infrastructure strategy.</li><li>collaborate across technical and business functions to bolster and achieve business objectives.</li><li>develop india’s best fintech infrastructure team</li><div><br></div>"},{"text":"you should apply if you:","content":"<li>have experience managing large, complex infrastructure deployments / distributed systems with 1-9 years of experience.</li><li>come with an interest in managing highly compliant financial services infrastructure and ensure the continuance of compliance against pci-dss, iso:27001:2013, data-localization (RBI) and NPCI guidelines</li><li>have designed and implemented security practices in the infrastructure, build tools, automate</li><li>understand the ecosystem around microservice architecture with regards to IAC, CI/CD, HA and monitoring</li><li>are interested to advance our current stack which consists of Java, Golang, Python, Node.js, Docker, Cloudformation, Codepipeline, Codebuild,ECS/Fargate, Datadog, Signalfx, Elasticsearch, Tick etc stacks</li>"}],"text":"site reliability engineer","country":"IN","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/cred/660cc862-3cc9-4c52-9ed8-ebb136c3711d","applyUrl":"https://jobs.lever.co/cred/660cc862-3cc9-4c52-9ed8-ebb136c3711d/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.\n\nto make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.\n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div><b style=\"font-size: 10pt\">how is life at CRED?</b></div><div><br></div><div><span style=\"font-size: 10pt\">working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</span></div><div><br></div><div><span style=\"font-size: 10pt\">hard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.</span></div><div><br></div><div><span style=\"font-size: 10pt\">to make things smoother and to make sure you spend time and energy only on the most important things, CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.</span></div><div><br></div><div><span style=\"font-size: 10pt\">there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</span></div>","categories":{"commitment":"full time","department":"business","location":"Bengaluru, Karnataka","team":"business - lending"},"createdAt":1666360766907,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India's most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.\n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.\n\nhere’s what will be in store for you at CRED once you join the team.\n","description":"<div><b style=\"font-size: 10pt\">what is CRED?</b></div><div><br></div><div><span style=\"font-size: 10pt\">CRED is an exclusive community for India's most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.</span></div><div><br></div><div><span style=\"font-size: 10pt\">here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.</span></div><div><br></div><div><span style=\"font-size: 10pt\">here’s what will be in store for you at CRED once you join the team.</span></div>","id":"cf19fe62-94f6-4872-87e6-37452ca4f47e","lists":[{"text":"what you will do:","content":"<li>work with risk and front-end collection team for better insights</li><li>own and create dial out strategies, floor mobility strategies and prioritization frameworks based on portfolio segments</li><li>bring new innovative collections practices into foray</li><li>ensure to have a highly customer centric collection team</li><li>manage cost of collections in a tight budget to ensure the P&amp;L becomes\tprofitable</li><li>develop and execute operations plan for the tele-calling sites</li><li>take initiatives to innovate tele-calling structures with an intent to create a sharply focused state of the art framework</li><li>examine strategic performance, spot emerging business &amp; product opportunities, identify business threats/blockers, look for novel strategic solutions, and develop creative action plans</li><li>be aware of what is happening on competition space and collection ecosystem and keep adding new ideas to improve collection efficiency</li>"},{"text":"you should apply if you have:","content":"<li>5-7 years of tele-calling collection experience in financial services</li><li>at least 2 years of experience in fintech collection space</li><li>the required knowledge and flare to work with new technology solutions and ability to get deep into problem solving of critical concerns</li><li>exceptional analytical, problem solving and research skills and resource knowledge</li><li>the ability to manage large teams with approach to coaching and training your team members</li><li>clear eye to see the bigger picture in mind and have the decisiveness to affect the long-term viability of the product</li>"}],"text":"soft collections lead","country":"IN","workplaceType":"unspecified","hostedUrl":"https://jobs.lever.co/cred/cf19fe62-94f6-4872-87e6-37452ca4f47e","applyUrl":"https://jobs.lever.co/cred/cf19fe62-94f6-4872-87e6-37452ca4f47e/apply"},{"additionalPlain":"how is life at CRED? \n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating.  \n\nat CRED, we guarantee a good company. \n\nhard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.  \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.  \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n\n","additional":"<div><b style=\"font-size: 10.5pt\">how is life at CRED?&nbsp;</b></div><div><br></div><div><span style=\"font-size: 10.5pt\">working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating.&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">at CRED, we guarantee a good company.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">hard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</span></div><div><br></div>","categories":{"commitment":"full time","department":"business","location":"Bengaluru, Karnataka","team":"business- brand promotions"},"createdAt":1673352147883,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India's most trustworthy and creditworthy individuals, where the members are rewarded for good financial behaviour. \n\nCRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behaviour to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere's what will be in store for you at CRED once you join the team\n\n","description":"<div><b style=\"font-size: 10.5pt\">what is CRED?</b></div><div><br></div><div><span style=\"font-size: 10.5pt\">CRED is an exclusive community for India's most trustworthy and creditworthy individuals, where the members are rewarded for good financial behaviour.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behaviour to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">here's what will be in store for you at CRED once you join the team</span></div><div><br></div>","id":"2c9fa026-19ce-4981-968c-b6713a2337ab","lists":[{"text":"what you will do?","content":"<li>create a systematic, process-driven approach to identify and source partnership opportunities&nbsp;</li><li>structure, negotiate and execute partnership deals with brands and organizations across various categories</li><li>plan and own monthly/quarterly supply &amp; monetization goals with new and existing partner relationships&nbsp;</li><li>shape product and business by building powerful and lasting partnerships that offer brands/merchants innovative ways to grow</li><li>interface with other CRED teams like Product, Marketing, Analytics etc to drive win-win-win engagements for CRED consumers, brands and CRED</li><li>liaison with product, ops, legal, &amp; finance teams to ensure end-to-end process adherence &amp; ownership is ensured to run a smooth ad revenue&nbsp; engine</li><li>help the product team discover brand/merchant needs more effectively and help evolve the CRED product</li><li>deliver great partner experience (partner NPS) when working with our organization - you will represent CRED and be our partner’s liaison internally</li><li>manage a team of 3-5 partnerships managers to help grow the CRED business</li>"},{"text":"you should apply if you: ","content":"<li>have 8-12 years of strategic partnership experience, preferably in brand promotion, partnership roles or with client facing roles in reputed marketing agencies&nbsp;</li><li>have managed marketing budgets and targets for clients across multiple industries</li><li>are familiar with current digital avenues and metrics brands leverage for awareness, visibility &amp; engagement</li><li>have an established network of relationship across industries</li><li>are an excellent negotiator; have outstanding communication and interpersonal skills</li><li>are comfortable with data and research, to be able to map the potential of each brand, category or industry</li><li>are goal-oriented &amp; thrive in high ownership, fast paced and independent environment</li><li>have the ability to deal with ambiguity and chart a path forward</li><li>have excellent organizational and time management skills</li><li>ideally, been a people manager in the past.</li>"}],"text":"strategic partnerships lead","country":"IN","workplaceType":"onsite","hostedUrl":"https://jobs.lever.co/cred/2c9fa026-19ce-4981-968c-b6713a2337ab","applyUrl":"https://jobs.lever.co/cred/2c9fa026-19ce-4981-968c-b6713a2337ab/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realize pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div><div><br></div>","categories":{"commitment":"consultant","department":"talent & culture","location":"Bengaluru, Karnataka","team":"Talent - Acquistion"},"createdAt":1672122170799,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a part of the team\n\n","description":"<div><b>what is CRED?</b></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a part of the team</div><div><br></div>","id":"6fe4f25a-d6d2-4ba5-8a09-6ed9dc9e13fb","lists":[{"text":"what will you do?","content":"<li>work closely with recruiters in driving the interview process for candidates</li><li>partner with recruitment and business stakeholders to provide an exceptional candidate experience</li><li>schedule and arrange candidate interviews by coordinating with the hiring panel for their timings</li><li>assist with identifying any gaps or issues affecting the recruitment process</li><li>data management for all recruitment efforts</li>"},{"text":"you should apply if you:","content":"<li>possess 1-2 years of experience in recruitment and have a good understanding about the recruitment life cycle</li><li>have the ability to manage multiple stakeholders for day to day tasks</li><li>are a great communicator and can influence stakeholders</li><li>exhibit attention to detail while carrying out your responsibilities</li>"}],"text":"talent co-ordinator - technology","country":"IN","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/cred/6fe4f25a-d6d2-4ba5-8a09-6ed9dc9e13fb","applyUrl":"https://jobs.lever.co/cred/6fe4f25a-d6d2-4ba5-8a09-6ed9dc9e13fb/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div><div><br></div>","categories":{"commitment":"full time","department":"engineering","location":"Bengaluru, Karnataka","team":"Backend & Platform - Backend"},"createdAt":1641647181970,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behaviour. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behaviour to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as an ‘technology leader’.\n\nwhat will you do?\n\n","description":"<div><b>what is CRED?</b></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behaviour. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behaviour to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as an ‘technology leader’.</div><div><br></div><div><b>what will you do?</b></div><div><br></div>","id":"d487c18d-f5e0-40e8-9a1d-f315d87b181e","lists":[{"text":"technology leadership","content":"<li>creates a culture to enable technology as a catalyst for solving business &amp; customer problems.</li><li>ensure the best engineering practices are adopted &amp; followed across the organization.</li><li>hands-on with technology stack and tools used by the team and can lead by example.</li><li>works closely with architects to choose the right technology stack &amp; rasp (reliability, availability, scalability &amp; performance) characteristics of the product are intact.</li><li>apply the first-principles approach to solving technological problems.&nbsp;</li>"},{"text":"delivery orientation","content":"<li>drives results &amp; focuses on outcomes.</li><li>responsible for timeliness and quality of deliverables.</li><li>communicates effectively and keeps internal &amp; external stakeholders updated on the progress of projects.</li><li>anticipate problems &amp; unblock the team proactively</li>"},{"text":"organizational leadership","content":"<li>understands the big picture &amp; impact of day to day decisions on business, product &amp; the customers.</li><li>sets the right direction for the team and leads by example.</li><li>align &amp; inspire the team to gravitate towards the shared vision.</li><li>enable agility to respond to product changes effectively.</li><li>innate ability to be trusted by everyone.</li>"},{"text":"people management","content":"<li>hire the right talent &amp; manage the team performance</li><li>mentor &amp; coach the team</li><li>actively engage with the team and help build their career path</li><li>manage conflicts proactively and provide timely feedback</li><li>motivate, inspire, recognize &amp; reward good performance</li>"},{"text":"you should apply if you:","content":"<li>possess 8+ years experience (with recent years of experience being engineering manager or staff engineer)</li><li>exhibit strong competencies in software design &amp; architecture along with a deeper understanding of the scalability of distributed systems.</li><li>are experienced in agile methodologies like scrum.</li><li>have the ability to make decisions independently.</li><li>are able to lend structure.</li><li>have the ability to communicate and manage stakeholders effectively.</li>"}],"text":"technology leader","country":"IN","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/cred/d487c18d-f5e0-40e8-9a1d-f315d87b181e","applyUrl":"https://jobs.lever.co/cred/d487c18d-f5e0-40e8-9a1d-f315d87b181e/apply"},{"additionalPlain":"how is life at CRED?\n\nworking at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.\n\nhard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance. \n\nto make things smoother and to make sure you spend time and energy only on the most important things,  CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game. \n\nthere are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.\n","additional":"<div><b>how is life at CRED?</b></div><div><br></div><div>working at CRED would instantly make you realize one thing: you are working with the best talent around you. not just in the role you occupy, but everywhere you go. talk to someone around you; most likely you will be talking to a singer, standup comic, artist, writer, an athlete, maybe a magician. at CRED people always have talent up their sleeves. with the right company, even conversations can be rejuvenating. at CRED, we guarantee a good company.</div><div><br></div><div>hard truths: pushing oneself comes with the role. and we realise pushing oneself is hard work. which is why CRED is in the continuous process of building an environment that helps the team rejuvenate oneself: included but not limited to a stacked, in-house pantry, with lunch and dinner provided for all the team members, paid sick leaves and a comprehensive health insurance.&nbsp;</div><div><br></div><div>to make things smoother and to make sure you spend time and energy only on the most important things,&nbsp; CRED strives to make every process transparent: there are no work timings because we do not believe in archaic methods of calculating productivity, your work should speak for you. there are no job designations because you will be expected to hold down roles that cannot be described in one word. since trust is a major virtue in the community we have built, we make it a point to highlight it in the community behind CRED: all our employees get their salaries before their joining date. a show of trust that speaks volumes because of the skin in the game.&nbsp;</div><div><br></div><div>there are many more such eccentricities that make CRED what it is but that’s for one to discover. if you feel at home reading this, get in touch.</div>","categories":{"commitment":"full time","department":"infrastructure & security","location":"Bengaluru, Karnataka","team":"Security & Compliance - Central"},"createdAt":1641303350124,"descriptionPlain":"what is CRED?\n\nCRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior. CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception. to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true. \n\nhere’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better. \n\nhere’s what will be in store for you at CRED once you join as a part of the team \n","description":"<div><b>what is CRED?</b></div><div><br></div><div>CRED is an exclusive community for India’s most trustworthy and creditworthy individuals, where the members are rewarded for good financial behavior.&nbsp;CRED was born out of a need to bring back the focus on a long lost virtue, one of trust, the idea being to create a community centered around this virtue. a community that constantly strives to become more virtuous in this regard till they finally scale their behavior to create a utopia where being trustworthy is the norm and not the exception.&nbsp;to build a community like this requires a community of its own; a community special in its own way, working towards making this vision come true.&nbsp;</div><div><br></div><div>here’s a thought experiment: what do you get when you put a group of incredibly passionate and driven people and entrust them with the complete freedom to chase down their goals in a completely uninhibited manner? answer: you get something close to what we have at CRED; CRED just has it better.&nbsp;</div><div><br></div><div>here’s what will be in store for you at CRED once you join as a part of the team&nbsp;</div>","id":"4b3f0872-82a5-4bd7-a5a5-f0e2af3e6c8c","lists":[{"text":"what you will do:","content":"<li>work on a diverse domain of information security across the organisation, most important infrastructure and data security</li><li>responsible identifying security issues (external as well as internal), help stakeholders to mitigate and at frequent occasions build a solution around some of the complex problem statements implement/maintain security for cloud-based systems/applications</li><li>formulate new detection ideas based on newly-published research, industry trends, or major incidents.</li><li>respond to security incidents and think of how to prevent such incidents</li><li>develop and enhance the CRED’s detection, monitoring and response capabilities</li><li>automate various security incident responses using playbook</li><li>build in-house security analytics solutions using open source tools (log parsing, event correlation and threat detection)</li><li>research/conduct threat hunting operations using known adversary tactics, techniques and procedures to detect advanced threats</li><li>build in-house security frameworks to establish a state of art security culture inside tech</li><li>be responsible to track security incident responses across the organisation</li><li>assist with creating security awareness and maintaining prudent security engineering culture within an organisation</li><li>enable compliance in teams and help them achieve some of the industry’s best practices (e.g. PCI DSS, ISO 27001)</li><div><br></div>"},{"text":"you should apply if you have:","content":"<li>2-9 years of experience in information security</li><li>proficiency in one of the programming languages (python, golang, bash)</li><li>the ability to be a go-to person and communicate effectively with stakeholders (engineers, product, business teams)</li><li>an understanding of MITRE ATT&amp;CK, Cyber Kill Chain, Diamond Model</li><li>knowledge in operating centralised log analysis tools - ELK, Splunk, etc</li><li>experience with deploying custom-built and scalable security solutions &amp; enterprise or open-source security tools - SIEM, IDS/IPS, EDR, FIM, PAM</li><li>experience with handling incident response life-cycle (detection, identification, containment, analysis, remediation and reporting)</li><li>the ability to read packet capture or memory dumps and create regex on the fly.</li><li>a GitHub profile, blog or a conference presentation</li><li>the ability to influence organisations and stakeholders by practising a data-driven approach</li><li>the ability to be proactive in keeping yourself updated with security news/issues/breaches/tools/blogs on the internet</li><li>the zeal to explore diverse domains of information security and have a fast learning curve</li><li>the ability to distil complex security threats and risks into simple terms for non-security (and even non-technical) stakeholders.&nbsp;</li><div><br></div>"}],"text":"threat detection engineer","country":"IN","workplaceType":"unspecified","hostedUrl":"https://jobs.lever.co/cred/4b3f0872-82a5-4bd7-a5a5-f0e2af3e6c8c","applyUrl":"https://jobs.lever.co/cred/4b3f0872-82a5-4bd7-a5a5-f0e2af3e6c8c/apply"}]